// Вывести квадрат числа
Console.WriteLine("Введите целое число: ");
int num = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Квадрат числа " + num + " равен: " + (num*num) + ".");